# memberTypeKey Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
TrussMemberInfo..::..memberTypeKey Property
TrussMemberInfo Class See Also
---
Kind of the member in the truss.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public TrussMemberType memberTypeKey { get; set; }
```

Visual Basic
---
```text
Public Property memberTypeKey As TrussMemberType
	Get
	Set
```

Visual C++
---
```text
public:
property TrussMemberType memberTypeKey {
	TrussMemberType get ();
	void set (TrussMemberType value);
}
```

# See Also
TrussMemberInfo Class
Autodesk.Revit.DB.Structure Namespace